#include <iostream>
using namespace std;

/*
Завдання 1:
Реалізуйте клас стек для роботи з символами (символь-
ний стек). Стек повинен мати фіксований розмір. Також
реалізуйте набір операцій для роботи зі стеком: внесення
символу в стек, видалення символу зі стеку, підрахунок
кількості символів в стеці, перевірку, чи стек порожній,
перевірку, чи стек повний, очищення стеку, отримання
без видалення верхнього символу в стеці.

Завдання 2:
Змініть стек з першого завдання зі статичного типу на
динамічний (за нестачі вільного місця потрібно змінити
розмір внутрішнього масиву без втрати даних).

Завдання 3:
До створеного класа Stack додати шаблонний тип для елементів масива.
Додати можливість в параметризований конструткор крім місткості передавати
набір значень стека, застосувати initializer_list.

*/



int main()
{
    std::cout << "Hello World!\n";
}
