#include <iostream>
using namespace std;

/*
Завдання 1:
Створити клас «Time», який буде описувати час 3-ма характеристиками: години, хвилини, секунди.
В класі потрібно реалізувати наступні конструктори:
•	Конструктор по замовчуванню () – встановлюватиме початкові дані
•	Параметризований (hours, minutes, seconds) – встановлює кожну властивість
•	Параметризований (seconds) – створює клас перевівши дану
     кількість секунд в години, хвилини, секунди. Наприклад: 5555 = 1год 32хв 35сек
•	5555/3600- h; 5555/60%60 – m; 5555%60 - s

Також передбачити методи:
1.	Виводу часу на екран в форматі hh:mm:ss
2.	Збільшення часу на одну секунду (11:59:59)++ -> 12:00:00

Клас повинен мати перевантаження наступних бінарних операторів:
•	+ – * /	виконується певна арифметична операція
     з часом та повертається результат у вигляді нового об'єкту Time
•	> < >= <=	перевіряється, який об’єкт містить
     більшу/меншу кількість часу та повертається результат у вигляді типу bool
•	== !=		перевіряється чи класи мають не/однаковий час
Використайте explicit для деяких конструкторів.

Додаткове персональе завдання: Додати дні.
*/

class Time {
    int days;
    int hours;
    int minutes;
    int seconds;
public:
    void HelloMessage() {
        if (hours >= 5 && hours < 12)
            cout << "Good Morning" << endl;
        else if (hours >= 12 && hours < 18)
            cout << "Good Afternoon" << endl;
        else if (hours >= 18 && hours < 22)
            cout << "Good Evening" << endl;
        else cout << "Good Night" << endl;
    }
};






int main()
{
    cout << "Hello World!\n";

}