#include <iostream>
using namespace std;
/*
Завдання 1:
Створити клас Rectangle1, який буде описувати прямокутник. Клас містить розміри: ширина, висота, символ, який відображатиме прямокутник на екрані та координати розміщення. Для збереження координат створити структуру Coord, яка міститиме X та Y координату.
Клас повинен містити наступні конструктори:
Конструктор по замовчуванню, який встановлюватиме «дефолтні» дані
Параметризований конструктор, який приймає один параметр «розмір» та ініціалізує ним ширину та висоту
Параметризований конструктор, який приймає два параметри «ширину» та «висоту», які являються розмірами об’єкта
Та наступні методи:
Вивід фігури на екран, відповідного розміру, символом та у відповідних координатах
Зміна розміру прямокутника. Метод приймає два парметри: 1 – зміна висоти, 2 – ширини
Переміщення прямокутника. Метод приймає два парметри: 1 – величина переміщення по осі X, 2 – по осі Y
Методи повинні включати перевірку на коректність даних (від’ємна ширина, координати і тд). Створити екземпляр об’єкту та протестувати написаті методи.
*/


int main()
{
   
    
}
