#include <iostream>
using namespace std;

/*
Тема: Move Constructor. operator =
Завдання 1:
Створити клас Point – точка на площині (x, y). Реалізувати набір відповідних констуркторів, метод Print() та перевантажити наступні оператори:
-- ++ – збільшує/зменшує кожну координату на 1
> < – перевіряє точки на розташування (ближче/далі) відносно початкової координати (0:0)
! – змінює значення координат на протилежне
Class Point
{
int x;
int y;
}
Завдання 2:
Наступним класом є Vector, який описується набором точок на площині. Клас містить динамічний масив точок та їх кількість.
class Vector
{
Point * points;
int countPoint;
}
Для класу потрібно реалізувати весь необхідний набір конструкторів (копіювання та переміщення обов'язково), оператор =, деструткор, метод Add() для додавання нової точки та Print() для виводу інформації на екран.
*Реалізувати вивів точок у відповідних координатах на консолі. Для цього можна використати функцію gotoxy
! Результат завантажити у вигляді .cpp файла.
* – додаткове завдання
*/










int main()
{
    










}