#include "PointClass.h"
#include "Vector.h"

/*
Завдання 1:
Створити клас Point – точка на площині (x, y).
Реалізувати набір відповідних констуркторів,
метод Print() та перевантажити наступні оператори:
-- ++ – збільшує/зменшує кожну координату на 1
> < – перевіряє точки на розташування (ближче/далі) відносно початкової координати (0:0)
! – змінює значення координат на протилежне

Завдання 2:
Наступним класом є Vector, який описується набором точок на площині.
Клас містить динамічний масив точок та їх кількість.

Для класу потрібно реалізувати весь необхідний набір конструкторів
(копіювання та переміщення обов'язково),
оператор =, деструткор, метод Add() для додавання нової точки та Print() для виводу інформації на екран.

*Реалізувати вивів точок у відповідних координатах на консолі. Для цього можна використати функцію gotoxy
! Результат завантажити у вигляді .cpp файла.
* – додаткове завдання
*/


int main()
{
    cout << "Hello =)" << endl << endl;
    Vector vector;
    vector.Add(Point(1, 2));
    vector.Add(Point(2, 3));
    vector.Add(Point(3, 4));
    vector.Add(Point(4, 5));
    vector.Add(Point(5, 6));
    vector.Add(Point(6, 7));
    vector.Add(Point(7, 8));
    vector.Print();

    vector.PrintAtPosition(16, 2);
}